In [ ]:
# <!-- Getting and knowing your Data -->

In [1]:
#improtinh teh important iberary
import pandas as pd
import numpy as np

In [2]:
# downloading the data and create the data frame
url = (" https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user")
df = pd.read_csv(url, sep="|")
df

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [3]:
# See the first 5 entries
df.head(5)

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [4]:
# What is the number of rows in the dataset?
df.shape[0]

943

In [5]:
# What is the number of columns in the dataset?
df.shape[1]

5

In [6]:
# What is the number of observations in the dataset?
df.index

RangeIndex(start=0, stop=943, step=1)

In [7]:
#  What is the name of columns in the dataset?
df.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [8]:
# what are the numbners of rows and columns in the data 
df.shape

(943, 5)

In [9]:
# What is the name of 105th column?
df.columns[2]

'gender'

In [10]:
# What is the type of the observations of the 105th column?

In [11]:
df.columns

# How is the dataset indexed?

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [12]:
#  What is the product name of the 19th observation?
df.values[18]

array([19, 40, 'M', 'librarian', '02138'], dtype=object)